#include "Data.h"

LARGE_INTEGER frequency;        // частота счетчика производительности
LARGE_INTEGER current_time;     // текущее значение счетчика производительности
LARGE_INTEGER previous_time;    // значение счетчика производительности на предыдущем кадре
double elapsed_time;            // врем€, затраченное на отрисовку кадра
double fps;                     // количество кадров в секунду
char window_title[256];         // заголовок окна
unsigned int timer = 0;
// »—ѕќЋ№«”≈ћџ… Ў≈…ƒ≈– (ѕќ ј “ќЋ№ ќ ќƒ»Ќ)
Shader shader;
// ƒјЌЌџ≈ ƒЋя ¬џ¬ќƒј ѕ–яћќ”√ќЋ№Ќ» ј
// текущее смещение пр€моугольника
vec2 offset = vec2(0.25, 0);
// скорость (направление) перемещени€ пр€моугольника
vec2 speed = vec2(+0.30, -0.25);
// первый цвет (дл€ градиентной заливки)
vec4 color1 = vec4(1, 0, 0, 1);
// второй цвет (дл€ градиентной заливки)
vec4 color2 = vec4(0, 0, 1, 1);

// функци€ дл€ инициализации всех общих данных (камера, объекты и т.д.)
void initData() {

}
// функци€ дл€ вывода квадрата с ребрами равными единице (от -0.5 до +0.5)
void drawObject()
{
	{
		// переменные дл€ вывода объекта (пр€моугольника из двух треугольников)
		static GLuint VAO_Index = 0;	// индекс VAO-буфера
		static GLuint VBO_Index = 0;	// индекс VBO-буфера
		static int VertexCount = 0;		// количество вершин
		static bool init = true;

		if (init) {
			// создание и заполнение VBO
			glGenBuffers(1, &VBO_Index);
			glBindBuffer(GL_ARRAY_BUFFER, VBO_Index);
			GLfloat Verteces[] = {
				// передн€€ грань (два треугольника)
				-0.5, +0.5, +0.5, -0.5, -0.5, +0.5, +0.5, +0.5, +0.5,
				+0.5, +0.5, +0.5, -0.5, -0.5, +0.5, +0.5, -0.5, +0.5,
				// задн€€ грань (два треугольника)
				+0.5, +0.5,	-0.5, +0.5, -0.5, -0.5, -0.5, +0.5, -0.5,
				-0.5, +0.5,	-0.5, +0.5, -0.5, -0.5, -0.5, -0.5, -0.5,
				// права€ грань (два треугольника) 
				+0.5, -0.5,	+0.5, +0.5, -0.5, -0.5, +0.5, +0.5, +0.5,
				+0.5, +0.5,	+0.5, +0.5, -0.5, -0.5, +0.5, +0.5, -0.5,
				// лева€ грань (два треугольника)
				-0.5, +0.5,	+0.5, -0.5, +0.5, -0.5, -0.5, -0.5, +0.5,
				-0.5, -0.5,	+0.5, -0.5, +0.5, -0.5, -0.5, -0.5, -0.5,
				// верхн€€ грань (два треугольника)
				-0.5, +0.5, -0.5, -0.5, +0.5, +0.5, +0.5, +0.5, -0.5,
				+0.5, +0.5, -0.5, -0.5, +0.5, +0.5, +0.5, +0.5, +0.5,
				// нижн€€ грань (два треугольника)
				-0.5, -0.5, +0.5, -0.5, -0.5, -0.5, +0.5, -0.5, +0.5,
				+0.5, -0.5, +0.5, -0.5, -0.5, -0.5, +0.5, -0.5, -0.5
			};
			glBufferData(GL_ARRAY_BUFFER, sizeof(Verteces), Verteces, GL_STATIC_DRAW);

			// создание VAO
			glGenVertexArrays(1, &VAO_Index);
			glBindVertexArray(VAO_Index);

			// инициализаци€ VAO
			glBindBuffer(GL_ARRAY_BUFFER, VBO_Index);
			int location = 0;
			glVertexAttribPointer(location, 3, GL_FLOAT, GL_FALSE, 0, 0);
			glEnableVertexAttribArray(location);

			// "отв€зка" буфера VAO на вс€кий случай, чтоб случайно не испортить
			glBindVertexArray(0);

			// указание количество вершин
			VertexCount = 6 * 6;
			init = false;
		}

		// вывод модели кубика на экран
		glBindVertexArray(VAO_Index);
		glDrawArrays(GL_TRIANGLES, 0, VertexCount);
}